LightWind1/ESP32_Arduino_LBJ/HW_RADIO_CC1101.h
/*-----------------------------------------------------------------------
*@file     HW_RADIO_CC1101.h
*@brief    德州仪器CC1101无线芯片驱动程序 - 头文件
*@author   谢英男(xieyingnan1994@163.com）
*@version  1.0
*@date     2020/07/14
-----------------------------------------------------------------------*/
#ifndef HW_RADIO_CC1101_H
#define HW_RADIO_CC1101_H

#include <Arduino.h>

///*
#define CC1101_SCK_PIN		18
#define CC1101_MISO_PIN		19
#define CC1101_MOSI_PIN		23
#define CC1101_CS_PIN 		5
#define CC1101_GDO0_PIN 	36
#define CC1101_GDO2_PIN 	25
//*/
/*
#define CC1101_SCK_PIN		25
#define CC1101_MISO_PIN		27
#define CC1101_MOSI_PIN		26
#define CC1101_CS_PIN 		33
#define CC1101_GDO0_PIN 	36
#define CC1101_GDO2_PIN 	2
*/

// CC1101 physical layer properties
#define CC1101_FIFO_SIZE                      	  	  64
#define CC1101_CRYSTAL_FREQ                           26.0
// CC1101 SPI commands
#define CC1101_CMD_READ                               0x80
#define CC1101_CMD_WRITE                              0x00
#define CC1101_CMD_BURST                              0x40
#define CC1101_CMD_READ_BURST                         0xC0
#define CC1101_CMD_ACCESS_STATUS_REG                  0x40
#define CC1101_CMD_RESET                              0x30
#define CC1101_CMD_FSTXON                             0x31
#define CC1101_CMD_XOFF                               0x32
#define CC1101_CMD_CAL                                0x33
#define CC1101_CMD_RX                                 0x34
#define CC1101_CMD_TX                                 0x35
#define CC1101_CMD_IDLE                               0x36
#define CC1101_CMD_WOR                                0x38
#define CC1101_CMD_POWER_DOWN                         0x39
#define CC1101_CMD_FLUSH_RX                           0x3A
#define CC1101_CMD_FLUSH_TX                           0x3B
#define CC1101_CMD_WOR_RESET                          0x3C
#define CC1101_CMD_NOP                                0x3D
// CC1101 register map
#define CC1101_REG_IOCFG2                             0x00
#define CC1101_REG_IOCFG1                             0x01
#define CC1101_REG_IOCFG0                             0x02
#define CC1101_REG_FIFOTHR                            0x03
#define CC1101_REG_SYNC1                              0x04
#define CC1101_REG_SYNC0                              0x05
#define CC1101_REG_PKTLEN                             0x06
#define CC1101_REG_PKTCTRL1                           0x07
#define CC1101_REG_PKTCTRL0                           0x08
#define CC1101_REG_ADDR                               0x09
#define CC1101_REG_CHANNR                             0x0A
#define CC1101_REG_FSCTRL1                            0x0B
#define CC1101_REG_FSCTRL0                            0x0C
#define CC1101_REG_FREQ2                              0x0D
#define CC1101_REG_FREQ1                              0x0E
#define CC1101_REG_FREQ0                              0x0F
#define CC1101_REG_MDMCFG4                            0x10
#define CC1101_REG_MDMCFG3                            0x11
#define CC1101_REG_MDMCFG2                            0x12
#define CC1101_REG_MDMCFG1                            0x13
#define CC1101_REG_MDMCFG0                            0x14
#define CC1101_REG_DEVIATN                            0x15
#define CC1101_REG_MCSM2                              0x16
#define CC1101_REG_MCSM1                              0x17
#define CC1101_REG_MCSM0                              0x18
#define CC1101_REG_FOCCFG                             0x19
#define CC1101_REG_BSCFG                              0x1A
#define CC1101_REG_AGCCTRL2                           0x1B
#define CC1101_REG_AGCCTRL1                           0x1C
#define CC1101_REG_AGCCTRL0                           0x1D
#define CC1101_REG_WOREVT1                            0x1E
#define CC1101_REG_WOREVT0                            0x1F
#define CC1101_REG_WORCTRL                            0x20
#define CC1101_REG_FREND1                             0x21
#define CC1101_REG_FREND0                             0x22
#define CC1101_REG_FSCAL3                             0x23
#define CC1101_REG_FSCAL2                             0x24
#define CC1101_REG_FSCAL1                             0x25
#define CC1101_REG_FSCAL0                             0x26
#define CC1101_REG_RCCTRL1                            0x27
#define CC1101_REG_RCCTRL0                            0x28
#define CC1101_REG_FSTEST                             0x29
#define CC1101_REG_PTEST                              0x2A
#define CC1101_REG_AGCTEST                            0x2B
#define CC1101_REG_TEST2                              0x2C
#define CC1101_REG_TEST1                              0x2D
#define CC1101_REG_TEST0                              0x2E
#define CC1101_REG_PARTNUM                            0x30
#define CC1101_REG_VERSION                            0x31
#define CC1101_REG_FREQEST                            0x32
#define CC1101_REG_LQI                                0x33
#define CC1101_REG_RSSI                               0x34
#define CC1101_REG_MARCSTATE                          0x35
#define CC1101_REG_WORTIME1                           0x36
#define CC1101_REG_WORTIME0                           0x37
#define CC1101_REG_PKTSTATUS                          0x38
#define CC1101_REG_VCO_VC_DAC                         0x39
#define CC1101_REG_TXBYTES                            0x3A
#define CC1101_REG_RXBYTES                            0x3B
#define CC1101_REG_RCCTRL1_STATUS                     0x3C
#define CC1101_REG_RCCTRL0_STATUS                     0x3D
#define CC1101_REG_PATABLE                            0x3E
#define CC1101_REG_FIFO                               0x3F

// CC1101_REG_IOCFG2                                                  MSB   LSB   DESCRIPTION
#define CC1101_GDO2_NORM                              0x00  //  6     6     GDO2 output: active high (default)
#define CC1101_GDO2_INV                               0x40  //  6     6                  active low

// CC1101_REG_IOCFG1
#define CC1101_GDO1_DS_LOW                            0x00  //  7     7     GDO1 output drive strength: low (default)
#define CC1101_GDO1_DS_HIGH                           0x80  //  7     7                                 high
#define CC1101_GDO1_NORM                              0x00  //  6     6     GDO1 output: active high (default)
#define CC1101_GDO1_INV                               0x40  //  6     6                  active low

