LightWind1/ESP32_Arduino_LBJ/HW_RADIO_CC1101.h
// CC1101_REG_CHANNR
#define CC1101_CHAN                                   0x00        //  7     0     channel number

// CC1101_REG_FSCTRL1
#define CC1101_FREQ_IF                                0x0F        //  4     0     IF frequency setting; f_IF = (f(XOSC) / 2^10) * CC1101_FREQ_IF

// CC1101_REG_FSCTRL0
#define CC1101_FREQOFF                                0x00        //  7     0     base frequency offset (2s-compliment)

// CC1101_REG_FREQ2 + REG_FREQ1 + REG_FREQ0
#define CC1101_FREQ_MSB                               0x1E        //  5     0     base frequency setting: f_carrier = (f(XOSC) / 2^16) * FREQ
#define CC1101_FREQ_MID                               0xC4        //  7     0         where f(XOSC) = 26 MHz
#define CC1101_FREQ_LSB                               0xEC        //  7     0               FREQ = 3-byte value of FREQ registers

// CC1101_REG_MDMCFG4
#define CC1101_CHANBW_E                               0x80  //  7     6     channel bandwidth: BW_channel = f(XOSC) / (8 * (4 + CHANBW_M)*2^CHANBW_E) [Hz]
#define CC1101_CHANBW_M                               0x00  //  5     4         default value for 26 MHz crystal: 203 125 Hz
#define CC1101_DRATE_E                                0x0C  //  3     0     symbol rate: R_data = (((256 + DRATE_M) * 2^DRATE_E) / 2^28) * f(XOSC) [Baud]

// CC1101_REG_MDMCFG3
#define CC1101_DRATE_M                                0x22  //  7     0         default value for 26 MHz crystal: 115 051 Baud

// CC1101_REG_MDMCFG2
#define CC1101_DEM_DCFILT_OFF                         0x80  //  7     7     digital DC filter: disabled
#define CC1101_DEM_DCFILT_ON                          0x00  //  7     7                        enabled - only for data rates above 250 kBaud (default)
#define CC1101_MOD_FORMAT_2_FSK                       0x00  //  6     4     modulation format: 2-FSK (default)
#define CC1101_MOD_FORMAT_GFSK                        0x10  //  6     4                        GFSK
#define CC1101_MOD_FORMAT_ASK_OOK                     0x30  //  6     4                        ASK/OOK
#define CC1101_MOD_FORMAT_4_FSK                       0x40  //  6     4                        4-FSK
#define CC1101_MOD_FORMAT_MFSK                        0x70  //  6     4                        MFSK - only for data rates above 26 kBaud
#define CC1101_MANCHESTER_EN_OFF                      0x00  //  3     3     Manchester encoding: disabled (default)
#define CC1101_MANCHESTER_EN_ON                       0x08  //  3     3                          enabled
#define CC1101_SYNC_MODE_NONE                         0x00  //  2     0     synchronization: no preamble/sync
#define CC1101_SYNC_MODE_15_16                        0x01  //  2     0                      15/16 sync word bits
#define CC1101_SYNC_MODE_16_16                        0x02  //  2     0                      16/16 sync word bits (default)
#define CC1101_SYNC_MODE_30_32                        0x03  //  2     0                      30/32 sync word bits
#define CC1101_SYNC_MODE_NONE_THR                     0x04  //  2     0                      no preamble sync, carrier sense above threshold
#define CC1101_SYNC_MODE_15_16_THR                    0x05  //  2     0                      15/16 sync word bits, carrier sense above threshold
#define CC1101_SYNC_MODE_16_16_THR                    0x06  //  2     0                      16/16 sync word bits, carrier sense above threshold
#define CC1101_SYNC_MODE_30_32_THR                    0x07  //  2     0                      30/32 sync word bits, carrier sense above threshold

// CC1101_REG_MDMCFG1
#define CC1101_FEC_OFF                                0x00  //  7     7     forward error correction: disabled (default)
#define CC1101_FEC_ON                                 0x80  //  7     7                               enabled - only for fixed packet length
#define CC1101_NUM_PREAMBLE_2                         0x00  //  6     4     number of preamble bytes: 2
#define CC1101_NUM_PREAMBLE_3                         0x10  //  6     4                               3
#define CC1101_NUM_PREAMBLE_4                         0x20  //  6     4                               4 (default)
#define CC1101_NUM_PREAMBLE_6                         0x30  //  6     4                               6
#define CC1101_NUM_PREAMBLE_8                         0x40  //  6     4                               8
#define CC1101_NUM_PREAMBLE_12                        0x50  //  6     4                               12
#define CC1101_NUM_PREAMBLE_16                        0x60  //  6     4                               16
#define CC1101_NUM_PREAMBLE_24                        0x70  //  6     4                               24
#define CC1101_CHANSPC_E                              0x02  //  1     0     channel spacing: df_channel = (f(XOSC) / 2^18) * (256 + CHANSPC_M) * 2^CHANSPC_E [Hz]

// CC1101_REG_MDMCFG0
#define CC1101_CHANSPC_M                              0xF8  //  7     0         default value for 26 MHz crystal: 199 951 kHz

// CC1101_REG_DEVIATN
#define CC1101_DEVIATION_E                            0x40  //  6     4     frequency deviation: f_dev = (f(XOSC) / 2^17) * (8 + DEVIATION_M) * 2^DEVIATION_E [Hz]
#define CC1101_DEVIATION_M                            0x07  //  2     0     default value for 26 MHz crystal: +- 47 607 Hz
#define CC1101_MSK_PHASE_CHANGE_PERIOD                0x07  //  2     0     phase change symbol period fraction: 1 / (MSK_PHASE_CHANGE_PERIOD + 1)

// CC1101_REG_MCSM2
#define CC1101_RX_TIMEOUT_RSSI_OFF                    0x00  //  4     4     Rx timeout based on RSSI value: disabled (default)
#define CC1101_RX_TIMEOUT_RSSI_ON                     0x10  //  4     4                                     enabled
#define CC1101_RX_TIMEOUT_QUAL_OFF                    0x00  //  3     3     check for sync word on Rx timeout
#define CC1101_RX_TIMEOUT_QUAL_ON                     0x08  //  3     3     check for PQI set on Rx timeout
#define CC1101_RX_TIMEOUT_OFF                         0x07  //  2     0     Rx timeout: disabled (default)
#define CC1101_RX_TIMEOUT_MAX                         0x00  //  2     0                 max value (actual value depends on WOR_RES, EVENT0 and f(XOSC))

// CC1101_REG_MCSM1
#define CC1101_CCA_MODE_ALWAYS                        0x00  //  5     4     clear channel indication: always
#define CC1101_CCA_MODE_RSSI_THR                      0x10  //  5     4                               RSSI below threshold
#define CC1101_CCA_MODE_RX_PKT                        0x20  //  5     4                               unless receiving packet
#define CC1101_CCA_MODE_RSSI_THR_RX_PKT               0x30  //  5     4                               RSSI below threshold unless receiving packet (default)
#define CC1101_RXOFF_IDLE                             0x00  //  3     2     next mode after packet reception: idle (default)
#define CC1101_RXOFF_FSTXON                           0x04  //  3     2                                       FSTxOn
#define CC1101_RXOFF_TX                               0x08  //  3     2                                       Tx
#define CC1101_RXOFF_RX                               0x0C  //  3     2                                       Rx
#define CC1101_TXOFF_IDLE                             0x00  //  1     0     next mode after packet transmission: idle (default)
#define CC1101_TXOFF_FSTXON                           0x01  //  1     0                                          FSTxOn
#define CC1101_TXOFF_TX                               0x02  //  1     0                                          Tx
#define CC1101_TXOFF_RX                               0x03  //  1     0                                          Rx

