LightWind1/ESP32_Arduino_LBJ/HW_RADIO_CC1101.h
// CC1101_REG_MCSM0
#define CC1101_FS_AUTOCAL_NEVER                       0x00  //  5     4     automatic calibration: never (default)
#define CC1101_FS_AUTOCAL_IDLE_TO_RXTX                0x10  //  5     4                            every transition from idle to Rx/Tx
#define CC1101_FS_AUTOCAL_RXTX_TO_IDLE                0x20  //  5     4                            every transition from Rx/Tx to idle
#define CC1101_FS_AUTOCAL_RXTX_TO_IDLE_4TH            0x30  //  5     4                            every 4th transition from Rx/Tx to idle
#define CC1101_PO_TIMEOUT_COUNT_1                     0x00  //  3     2     number of counter expirations before CHP_RDYN goes low: 1 (default)
#define CC1101_PO_TIMEOUT_COUNT_16                    0x04  //  3     2                                                             16
#define CC1101_PO_TIMEOUT_COUNT_64                    0x08  //  3     2                                                             64
#define CC1101_PO_TIMEOUT_COUNT_256                   0x0C  //  3     2                                                             256
#define CC1101_PIN_CTRL_OFF                           0x00  //  1     1     pin radio control: disabled (default)
#define CC1101_PIN_CTRL_ON                            0x02  //  1     1                        enabled
#define CC1101_XOSC_FORCE_OFF                         0x00  //  0     0     do not force XOSC to remain on in sleep (default)
#define CC1101_XOSC_FORCE_ON                          0x01  //  0     0     force XOSC to remain on in sleep

// CC1101_REG_FOCCFG
#define CC1101_FOC_BS_CS_GATE_OFF                     0x00  //  5     5     do not freeze frequency compensation until CS goes high
#define CC1101_FOC_BS_CS_GATE_ON                      0x20  //  5     5     freeze frequency compensation until CS goes high (default)
#define CC1101_FOC_PRE_K                              0x00  //  4     3     frequency compensation loop gain before sync word: K
#define CC1101_FOC_PRE_2K                             0x08  //  4     3                                                        2K
#define CC1101_FOC_PRE_3K                             0x10  //  4     3                                                        3K (default)
#define CC1101_FOC_PRE_4K                             0x18  //  4     3                                                        4K
#define CC1101_FOC_POST_K                             0x00  //  2     2     frequency compensation loop gain after sync word: same as FOC_PRE
#define CC1101_FOC_POST_K_2                           0x04  //  2     2                                                       K/2 (default)
#define CC1101_FOC_LIMIT_NO_COMPENSATION              0x00  //  1     0     frequency compensation saturation point: no compensation - required for ASK/OOK
#define CC1101_FOC_LIMIT_BW_CHAN_8                    0x01  //  1     0                                              +- BW_chan/8
#define CC1101_FOC_LIMIT_BW_CHAN_4                    0x02  //  1     0                                              +- BW_chan/4 (default)
#define CC1101_FOC_LIMIT_BW_CHAN_2                    0x03  //  1     0                                              +- BW_chan/2

// CC1101_REG_BSCFG
#define CC1101_BS_PRE_KI                              0x00  //  7     6     clock recovery integral gain before sync word: Ki
#define CC1101_BS_PRE_2KI                             0x40  //  7     6                                                    2Ki (default)
#define CC1101_BS_PRE_3KI                             0x80  //  7     6                                                    3Ki
#define CC1101_BS_PRE_4KI                             0xC0  //  7     6                                                    4Ki
#define CC1101_BS_PRE_KP                              0x00  //  5     4     clock recovery proportional gain before sync word: Kp
#define CC1101_BS_PRE_2KP                             0x10  //  5     4                                                        2Kp
#define CC1101_BS_PRE_3KP                             0x20  //  5     4                                                        3Kp (default)
#define CC1101_BS_PRE_4KP                             0x30  //  5     4                                                        4Kp
#define CC1101_BS_POST_KI                             0x00  //  3     3     clock recovery integral gain after sync word: same as BS_PRE
#define CC1101_BS_POST_KI_2                           0x08  //  3     3                                                   Ki/2 (default)
#define CC1101_BS_POST_KP                             0x00  //  2     2     clock recovery proportional gain after sync word: same as BS_PRE
#define CC1101_BS_POST_KP_1                           0x04  //  2     2                                                       Kp (default)
#define CC1101_BS_LIMIT_NO_COMPENSATION               0x00  //  1     0     data rate compensation saturation point: no compensation
#define CC1101_BS_LIMIT_3_125                         0x01  //  1     0                                              +- 3.125 %
#define CC1101_BS_LIMIT_6_25                          0x02  //  1     0                                              +- 6.25 %
#define CC1101_BS_LIMIT_12_5                          0x03  //  1     0                                              +- 12.5 %

// CC1101_REG_AGCCTRL2
#define CC1101_MAX_DVGA_GAIN_0                        0x00  //  7     6     reduce maximum available DVGA gain: no reduction (default)
#define CC1101_MAX_DVGA_GAIN_1                        0x40  //  7     6                                         disable top gain setting
#define CC1101_MAX_DVGA_GAIN_2                        0x80  //  7     6                                         disable top two gain setting
#define CC1101_MAX_DVGA_GAIN_3                        0xC0  //  7     6                                         disable top three gain setting
#define CC1101_LNA_GAIN_REDUCE_0_DB                   0x00  //  5     3     reduce maximum LNA gain by: 0 dB (default)
#define CC1101_LNA_GAIN_REDUCE_2_6_DB                 0x08  //  5     3                                 2.6 dB
#define CC1101_LNA_GAIN_REDUCE_6_1_DB                 0x10  //  5     3                                 6.1 dB
#define CC1101_LNA_GAIN_REDUCE_7_4_DB                 0x18  //  5     3                                 7.4 dB
#define CC1101_LNA_GAIN_REDUCE_9_2_DB                 0x20  //  5     3                                 9.2 dB
#define CC1101_LNA_GAIN_REDUCE_11_5_DB                0x28  //  5     3                                 11.5 dB
#define CC1101_LNA_GAIN_REDUCE_14_6_DB                0x30  //  5     3                                 14.6 dB
#define CC1101_LNA_GAIN_REDUCE_17_1_DB                0x38  //  5     3                                 17.1 dB
#define CC1101_MAGN_TARGET_24_DB                      0x00  //  2     0     average amplitude target for filter: 24 dB
#define CC1101_MAGN_TARGET_27_DB                      0x01  //  2     0                                          27 dB
#define CC1101_MAGN_TARGET_30_DB                      0x02  //  2     0                                          30 dB
#define CC1101_MAGN_TARGET_33_DB                      0x03  //  2     0                                          33 dB (default)
#define CC1101_MAGN_TARGET_36_DB                      0x04  //  2     0                                          36 dB
#define CC1101_MAGN_TARGET_38_DB                      0x05  //  2     0                                          38 dB
#define CC1101_MAGN_TARGET_40_DB                      0x06  //  2     0                                          40 dB
#define CC1101_MAGN_TARGET_42_DB                      0x07  //  2     0                                          42 dB

// CC1101_REG_AGCCTRL1
#define CC1101_AGC_LNA_PRIORITY_LNA2                  0x00  //  6     6     LNA priority setting: LNA2 first
#define CC1101_AGC_LNA_PRIORITY_LNA                   0x40  //  6     6                           LNA first (default)
#define CC1101_CARRIER_SENSE_REL_THR_OFF              0x00  //  5     4     RSSI relative change to assert carrier sense: disabled (default)
#define CC1101_CARRIER_SENSE_REL_THR_6_DB             0x10  //  5     4                                                   6 dB
#define CC1101_CARRIER_SENSE_REL_THR_10_DB            0x20  //  5     4                                                   10 dB
#define CC1101_CARRIER_SENSE_REL_THR_14_DB            0x30  //  5     4                                                   14 dB
#define CC1101_CARRIER_SENSE_ABS_THR                  0x00  //  3     0     RSSI threshold to assert carrier sense in 2s compliment, Thr = MAGN_TARGET + CARRIER_SENSE_ABS_TH [dB]

// CC1101_REG_AGCCTRL0
#define CC1101_HYST_LEVEL_NONE                        0x00  //  7     6     AGC hysteresis level: none
#define CC1101_HYST_LEVEL_LOW                         0x40  //  7     6                           low
#define CC1101_HYST_LEVEL_MEDIUM                      0x80  //  7     6                           medium (default)
#define CC1101_HYST_LEVEL_HIGH                        0xC0  //  7     6                           high
#define CC1101_WAIT_TIME_8_SAMPLES                    0x00  //  5     4     AGC wait time: 8 samples
#define CC1101_WAIT_TIME_16_SAMPLES                   0x10  //  5     4                    16 samples (default)
#define CC1101_WAIT_TIME_24_SAMPLES                   0x20  //  5     4                    24 samples
#define CC1101_WAIT_TIME_32_SAMPLES                   0x30  //  5     4                    32 samples
#define CC1101_AGC_FREEZE_NEVER                       0x00  //  3     2     freeze AGC gain: never (default)
#define CC1101_AGC_FREEZE_SYNC_WORD                   0x04  //  3     2                      when sync word is found
#define CC1101_AGC_FREEZE_MANUAL_A                    0x08  //  3     2                      manually freeze analog control
#define CC1101_AGC_FREEZE_MANUAL_AD                   0x0C  //  3     2                      manually freeze analog and digital control
#define CC1101_FILTER_LENGTH_8                        0x00  //  1     0     averaging length for channel filter: 8 samples
#define CC1101_FILTER_LENGTH_16                       0x01  //  1     0                                          16 samples (default)
#define CC1101_FILTER_LENGTH_32                       0x02  //  1     0                                          32 samples
#define CC1101_FILTER_LENGTH_64                       0x03  //  1     0                                          64 samples
#define CC1101_ASK_OOK_BOUNDARY_4_DB                  0x00  //  1     0     ASK/OOK decision boundary: 4 dB
#define CC1101_ASK_OOK_BOUNDARY_8_DB                  0x01  //  1     0                                8 dB (default)
#define CC1101_ASK_OOK_BOUNDARY_12_DB                 0x02  //  1     0                                12 dB
#define CC1101_ASK_OOK_BOUNDARY_16_DB                 0x03  //  1     0                                16 dB

// CC1101_REG_WOREVT1 + REG_WOREVT0
#define CC1101_EVENT0_TIMEOUT_MSB                     0x87        //  7     0     EVENT0 timeout: t_event0 = (750 / f(XOSC)) * EVENT0_TIMEOUT * 2^(5 * WOR_RES) [s]
#define CC1101_EVENT0_TIMEOUT_LSB                     0x6B        //  7     0         default value for 26 MHz crystal: 1.0 s

// CC1101_REG_WORCTRL
#define CC1101_RC_POWER_UP                            0x00  //  7     7     power up RC oscillator
#define CC1101_RC_POWER_DOWN                          0x80  //  7     7     power down RC oscillator
#define CC1101_EVENT1_TIMEOUT_4                       0x00  //  6     4     EVENT1 timeout: 4 RC periods
#define CC1101_EVENT1_TIMEOUT_6                       0x10 //  6     4                     6 RC periods
#define CC1101_EVENT1_TIMEOUT_8                       0x20  //  6     4                     8 RC periods
#define CC1101_EVENT1_TIMEOUT_12                      0x30  //  6     4                     12 RC periods
#define CC1101_EVENT1_TIMEOUT_16                      0x40  //  6     4                     16 RC periods
#define CC1101_EVENT1_TIMEOUT_24                      0x50  //  6     4                     24 RC periods
#define CC1101_EVENT1_TIMEOUT_32                      0x60  //  6     4                     32 RC periods
#define CC1101_EVENT1_TIMEOUT_48                      0x70  //  6     4                     48 RC periods (default)
#define CC1101_RC_CAL_OFF                             0x00  //  3     3     disable RC oscillator calibration
#define CC1101_RC_CAL_ON                              0x08  //  3     3     enable RC oscillator calibration (default)
#define CC1101_WOR_RES_1                              0x00  //  1     0     EVENT0 resolution: 1 period (default)
#define CC1101_WOR_RES_2_5                            0x01  //  1     0                        2^5 periods
#define CC1101_WOR_RES_2_10                           0x02  //  1     0                        2^10 periods
#define CC1101_WOR_RES_2_15                           0x03  //  1     0                        2^15 periods

// CC1101_REG_FREND1
#define CC1101_LNA_CURRENT                            0x01        //  7     6     front-end LNA PTAT current output adjustment
#define CC1101_LNA2MIX_CURRENT                        0x01        //  5     4     front-end PTAT output adjustment
#define CC1101_LODIV_BUF_CURRENT_RX                   0x01        //  3     2     Rx LO buffer current adjustment
#define CC1101_MIX_CURRENT                            0x02        //  1     0     mixer current adjustment

// CC1101_REG_FREND0
#define CC1101_LODIV_BUF_CURRENT_TX                   0x01        //  5     4     Tx LO buffer current adjustment
#define CC1101_PA_POWER                               0x00        //  2     0     set power amplifier power according to PATABLE

// CC1101_REG_FSCAL3
#define CC1101_CHP_CURR_CAL_OFF                       0x00  	//  5     4     disable charge pump calibration
#define CC1101_CHP_CURR_CAL_ON                        0x20  	//  5     4     enable charge pump calibration (default)
#define CC1101_FSCAL3                                 0x09      //  3     0     charge pump output current: I_out = I_0 * 2^(FSCAL3/4) [A]

