LightWind1/ESP32_Arduino_LBJ/HW_RADIO_CC1101.h
// CC1101_REG_FSCAL2
#define CC1101_VCO_CORE_LOW                           0x00  	//  5     5     VCO: low (default)
#define CC1101_VCO_CORE_HIGH                          0x20  	//  5     5          high
#define CC1101_FSCAL2                                 0x0A      //  4     0     VCO current result/override

// CC1101_REG_FSCAL1
#define CC1101_FSCAL1                                 0x20        //  5     0     capacitor array setting for coarse VCO tuning

// CC1101_REG_FSCAL0
#define CC1101_FSCAL0                                 0x0D        //  6     0     frequency synthesizer calibration setting

// CC1101_REG_RCCTRL1
#define CC1101_RCCTRL1                                0x41        //  6     0     RC oscillator configuration

// CC1101_REG_RCCTRL0
#define CC1101_RCCTRL0                                0x00        //  6     0     RC oscillator configuration

// CC1101_REG_PTEST
#define CC1101_TEMP_SENS_IDLE_OFF                     0x7F        //  7     0     temperature sensor will not be available in idle mode (default)
#define CC1101_TEMP_SENS_IDLE_ON                      0xBF        //  7     0     temperature sensor will be available in idle mode

// CC1101_REG_TEST0
#define CC1101_VCO_SEL_CAL_OFF                        0x00  //  1     1     disable VCO selection calibration stage
#define CC1101_VCO_SEL_CAL_ON                         0x02  //  1     1     enable VCO selection calibration stage

// CC1101_REG_PARTNUM
#define CC1101_PARTNUM                                0x00

// CC1101_REG_VERSION
#define CC1101_VERSION                                0x14

// CC1101_REG_MARCSTATE
#define CC1101_MARC_STATE_SLEEP                       0x00        //  4     0     main radio control state: sleep
#define CC1101_MARC_STATE_IDLE                        0x01        //  4     0                               idle
#define CC1101_MARC_STATE_XOFF                        0x02        //  4     0                               XOFF
#define CC1101_MARC_STATE_VCOON_MC                    0x03        //  4     0                               VCOON_MC
#define CC1101_MARC_STATE_REGON_MC                    0x04        //  4     0                               REGON_MC
#define CC1101_MARC_STATE_MANCAL                      0x05        //  4     0                               MANCAL
#define CC1101_MARC_STATE_VCOON                       0x06        //  4     0                               VCOON
#define CC1101_MARC_STATE_REGON                       0x07        //  4     0                               REGON
#define CC1101_MARC_STATE_STARTCAL                    0x08        //  4     0                               STARTCAL
#define CC1101_MARC_STATE_BWBOOST                     0x09        //  4     0                               BWBOOST
#define CC1101_MARC_STATE_FS_LOCK                     0x0A        //  4     0                               FS_LOCK
#define CC1101_MARC_STATE_IFADCON                     0x0B        //  4     0                               IFADCON
#define CC1101_MARC_STATE_ENDCAL                      0x0C        //  4     0                               ENDCAL
#define CC1101_MARC_STATE_RX                          0x0D        //  4     0                               RX
#define CC1101_MARC_STATE_RX_END                      0x0E        //  4     0                               RX_END
#define CC1101_MARC_STATE_RX_RST                      0x0F        //  4     0                               RX_RST
#define CC1101_MARC_STATE_TXRX_SWITCH                 0x10        //  4     0                               TXRX_SWITCH
#define CC1101_MARC_STATE_RXFIFO_OVERFLOW             0x11        //  4     0                               RXFIFO_OVERFLOW
#define CC1101_MARC_STATE_FSTXON                      0x12        //  4     0                               FSTXON
#define CC1101_MARC_STATE_TX                          0x13        //  4     0                               TX
#define CC1101_MARC_STATE_TX_END                      0x14        //  4     0                               TX_END
#define CC1101_MARC_STATE_RXTX_SWITCH                 0x15        //  4     0                               RXTX_SWITCH
#define CC1101_MARC_STATE_TXFIFO_UNDERFLOW            0x16        //  4     0                               TXFIFO_UNDERFLOW

// CC1101_REG_WORTIME1 + REG_WORTIME0
#define CC1101_WORTIME_MSB                            0x00        //  7     0     WOR timer value
#define CC1101_WORTIME_LSB                            0x00        //  7     0

// CC1101_REG_PKTSTATUS
#define CC1101_CRC_OK                                 0x80  //  7     7     CRC check passed
#define CC1101_CRC_RADIO_ERROR                              0x00  //  7     7     CRC check failed
#define CC1101_CS                                     0x40  //  6     6     carrier sense
#define CC1101_PQT_REACHED                            0x20  //  5     5     preamble quality reached
#define CC1101_CCA                                    0x10  //  4     4     channel clear
#define CC1101_SFD                                    0x08  //  3     3     start of frame delimiter - sync word received
#define CC1101_GDO2_ACTIVE                            0x04  //  2     2     GDO2 is active/asserted
#define CC1101_GDO0_ACTIVE                            0x01  //  0     0     GDO0 is active/asserted

// common status codes

/*!
  \brief No error, method executed successfully.
*/
#define RADIO_ERR_NONE                                      0
/*!
  \brief There was an unexpected, unknown error. If you see this, something went incredibly wrong.
  Your STM32 may be possessed, contact your local exorcist to resolve this error.
*/
#define RADIO_ERR_UNKNOWN                                   -1
/*!
  \brief Radio chip was not found during initialization. This can be caused by specifying wrong chip type in the constructor
  or by a fault in your wiring (incorrect slave select pin).
*/
#define RADIO_ERR_CHIP_NOT_FOUND                            -2

/*!
  \brief Failed to allocate memory for temporary buffer. This can be cause by not enough RAM or by passing invalid pointer.
*/
#define RADIO_ERR_MEMORY_ALLOCATION_FAILED                  -3

/*!
  \brief Packet supplied to transmission method was longer than limit.
*/
#define RADIO_ERR_PACKET_TOO_LONG                           -4

/*!
  \brief Timed out waiting for transmission finish.
*/
#define RADIO_ERR_TX_TIMEOUT                                -5

/*!
  \brief Timed out waiting for incoming transmission.
*/
#define RADIO_ERR_RX_TIMEOUT                                -6

/*!
  \brief The calculated and expected CRCs of received packet do not match.
  This means that the packet was damaged during transmission and should be sent again.
*/
#define RADIO_ERR_CRC_MISMATCH                              -7

/*!
  \brief The supplied bandwidth value is invalid for this module.
*/
#define RADIO_ERR_INVALID_BANDWIDTH                         -8

/*!
  \brief The supplied spreading factor value is invalid for this module.
*/
#define RADIO_ERR_INVALID_SPREADING_FACTOR                  -9

/*!
  \brief The supplied coding rate value is invalid for this module.
*/
#define RADIO_ERR_INVALID_CODING_RATE                       -10

/*!
  \brief Internal only.
*/
#define RADIO_ERR_INVALID_BIT_RANGE                         -11

/*!
  \brief The supplied frequency value is invalid for this module.
*/
#define RADIO_ERR_INVALID_FREQUENCY                         -12

/*!
  \brief The supplied output power value is invalid for this module.
*/
#define RADIO_ERR_INVALID_OUTPUT_POWER                      -13

/*!
  \brief LoRa preamble was detected during channel activity detection.
  This means that there is some LoRa device currently transmitting in your channel.
*/
#define RADIO_PREAMBLE_DETECTED                             -14

/*!
  \brief No LoRa preambles were detected during channel activity detection. Your channel is free.
*/
#define RADIO_CHANNEL_FREE                                  -15

/*!
  \brief Real value in SPI register does not match the expected one. This can be caused by faulty SPI wiring.
*/
#define RADIO_ERR_SPI_WRITE_FAILED                          -16

/*!
  \brief The supplied current limit value is invalid.
*/
#define RADIO_ERR_INVALID_CURRENT_LIMIT                     -17

/*!
  \brief The supplied preamble length is invalid.
*/
#define RADIO_ERR_INVALID_PREAMBLE_LENGTH                   -18

/*!
  \brief The supplied gain value is invalid.
*/
#define RADIO_ERR_INVALID_GAIN                              -19

/*!
  \brief User tried to execute modem-exclusive method on a wrong modem.
  For example, this can happen when you try to change LoRa configuration when FSK modem is active.
*/
#define RADIO_ERR_WRONG_MODEM                               -20

/*!
  \brief The supplied number of RSSI samples is invalid.
*/
#define RADIO_ERR_INVALID_NUM_SAMPLES                       -21

/*!
  \brief The supplied RSSI offset is invalid.
*/
#define RADIO_ERR_INVALID_RSSI_OFFSET                       -22

/*!
  \brief The supplied encoding is invalid.
*/
#define RADIO_ERR_INVALID_ENCODING                          -23

/*!
  \brief Supplied number of broadcast addresses is invalid.
*/
#define RADIO_ERR_INVALID_NUM_BROAD_ADDRS                   -24
/*!
  \brief Data shaping of output spectrum is invalid.
*/
#define RADIO_ERR_INVALID_DATA_SHAPING						-25
/*!
  \brief The format of sync words is invalid. 
*/
#define RADIO_ERR_INVALID_SYNC_WORD							-26
/*!
  \brief The biterate setting is invalid. 
*/
#define RADIO_ERR_INVALID_BIT_RATE							-27
/*!
  \brief The receive bandwidth setting is invalid. 
*/
#define RADIO_ERR_INVALID_RX_BANDWIDTH						-28
/*!
  \brief The frequency deviation is invalid. 
*/
#define RADIO_ERR_INVALID_FREQUENCY_DEVIATION				-29
/*!
  \brief A simple assert macro, will return on error.
*/
#define RADIO_ASSERT(STATEVAR) { if((STATEVAR) != RADIO_ERR_NONE) { return(STATEVAR); } }

/*!
  \brief Macro to check variable is within constraints - this is commonly used to check parameter ranges.
*/
#define RADIO_CHECK_RANGE(VAR, MIN, MAX, ERR) { if(!(((VAR) >= (MIN)) && ((VAR) <= (MAX)))) { return(ERR); } }

#ifdef RADIO_DEBUG_MSG_ON
	#define RADIO_DEBUG_MSG(...) printf(__VA_ARGS__)
#else
	#define RADIO_DEBUG_MSG(...)
#endif

