LightWind1/ESP32_Arduino_LBJ/HW_RADIO_CC1101.h
#ifdef RADIO_DEBUG_VERBOSE
	#define RADIO_VERBOSE_MSG(...) printf(__VA_ARGS__)
#else
	#define RADIO_VERBOSE_MSG(...)
#endif


static void SPISendCommand(uint8_t cmd);
void CC1101_StartReceive();


int8_t CC1101_GoIdle(void);	//使CC1101进入待命IDLE模式
int8_t CC1101_SetPacketLengthMode(uint8_t mode, uint8_t len);	//数据包长度模式配置
int8_t CC1101_SetEncoding(uint8_t encoding);//设置编码模式：曼彻斯特编码、数据白化功能是否启用
int8_t CC1101_SetDataShaping(float sh);//设置调制方式：2FSK或GFSK调制方式
int8_t CC1101_SetCrcFiltering(bool crcOn);//设置CRC校验功能开启/关闭
int8_t CC1101_DisableSyncWordFiltering(bool requireCarrierSense);//关闭同步字过滤功能并决定是保留载波检测功能
int8_t CC1101_EnableSyncWordFiltering(uint8_t maxErrBits, bool requireCarrierSense);
											//启用同步字过滤功能并决定是启用载波检测功能
int8_t CC1101_DisableAddressFiltering(void);//取消地址过滤功能
int8_t CC1101_EnableAddressFiltering(uint8_t nodeAddr, uint8_t numBroadcastAddrs);//启用地址过滤，
											//同时设置本机地址和广播地址的数量
uint32_t CC1101_GetPacketLength(bool update);//读取包长度
uint8_t CC1101_GetLQI(void);//取得链接质量指数
float CC1101_GetRSSI(void);//取得RSSI(接收信号强度指示)
int8_t CC1101_SetPreambleLength(uint8_t preambleLength);//设置前导码长度
int8_t CC1101_SetSyncWord(uint8_t SyncH, uint8_t SyncL, uint8_t maxErrBits,
							bool requireCarrierSense);//设置同步字及启用同步字过滤功能
int8_t CC1101_SetOutputPower(int8_t power);//设置射频发射功率
int8_t CC1101_SetFrequency(float freq);	//设置射频工作频率
int8_t CC1101_SetBitRate(float br);//设置码率,单位kbps
int8_t CC1101_SetRxBandwidth(float rxBw);//设置接收机滤波器带宽,单位kHz
int8_t CC1101_SetFrequencyDeviation(float freqDev);//设置FSK频偏,单位kHz

int8_t CC1101_ReadDataFIFO(uint8_t* data, uint32_t* actual_len);//从FIFO读取接收到的包数据
void CC1101_StartReceive(void (*RxCallback)(void));//进入接收模式，准备接收数据包
int8_t CC1101_TransmitWithAddress(uint8_t* data, uint32_t len,
								uint8_t addr);//发送数据包，带地址
int8_t CC1101_Transmit(uint8_t* data, uint32_t len);
													//发送数据包，无地址
int8_t CC1101_Setup(float freq, float br, float freqDev, float rxBw,
					 int8_t power, uint8_t preambleLength);//CC1101初始化配置

int8_t CC1101_IRQ(void);

#endif
